<ul class="other-goods__list">

    <?php $postid = get_the_id();
        $counter = new WP_Query( array(
            'post_type'     => 'counter',
            'posts_per_page'=> 5,
            'post__not_in'  => array($postid),
            'orderby'       => 'rand',
        ));
            while ( $counter->have_posts() ) :  $counter->the_post(); ?>

                <li class="other-goods__item">
                    <a href="<?php the_permalink(); ?>" class="other-goods__link">
                        <div class="other-goods__img">
                            <?php the_post_thumbnail( array(122,131),  array("alt" => get_the_title())); ?>
                        </div>
                        <div class="other-goods__info" style="background: <?php echo $counters_options['opt-color-card']; ?>">
                            <p class="other-goods__name"><?php the_title(); ?></p>
                            <p class="other-goods__cost">Цена <span class="other-goods__bold"><?php the_field('cost'); ?></span> р</p>
                        </div>
                    </a>
                </li>

    <?php endwhile; 
    wp_reset_postdata(); ?>
    
</ul>


<section class="article" id="article">
            <div class="container article__container">
                <h2 class="article__title">
                    Заголовок статьи
                </h2>
                <div class="article__content">
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                    <p>
                        Разнообразный и богатый опыт сложившаяся структура организации требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития. Таким образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании соответствующий условий активизации.
                    </p>
                </div>
            </div>
        </section>
        <section class="articles-inner">
            <div class="container articles-inner__container">
                <h2 class="articles-inner__title">
                    Другие статьи
                </h2>
                <ul class="articles-inner__list">
                    <li class="articles-inner__item">
                        <a href="article.html" class="articles-inner__link">
                            <div class="articles-inner__img">
                                <img src="img/f1.jpg" alt="фото">
                            </div>
                            <h3 class="articles-inner__subtitle">
                                Заголовок статьи
                            </h3>
                        </a>
                    </li>
                    <li class="articles-inner__item">
                        <a href="article.html" class="articles-inner__link">
                            <div class="articles-inner__img">
                                <img src="img/f1.jpg" alt="фото">
                            </div>
                            <h3 class="articles-inner__subtitle">
                                Заголовок статьи
                            </h3>
                        </a>
                    </li>
                    <li class="articles-inner__item">
                        <a href="article.html" class="articles-inner__link">
                            <div class="articles-inner__img">
                                <img src="img/f1.jpg" alt="фото">
                            </div>
                            <h3 class="articles-inner__subtitle">
                                Заголовок статьи
                            </h3>
                        </a>
                    </li>
                    <li class="articles-inner__item">
                        <a href="article.html" class="articles-inner__link">
                            <div class="articles-inner__img">
                                <img src="img/f1.jpg" alt="фото">
                            </div>
                            <h3 class="articles-inner__subtitle">
                                Заголовок статьи
                            </h3>
                        </a>
                    </li>
                </ul>
            </div>
        </section>